Revit 2027 API
RebarContainerItem.SetTerminationOrientation Method
 Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTerminationOrientation(
	int end,
	RebarTerminationOrientation hookOrientation
)
Public Sub SetTerminationOrientation (
	end As Integer,
	hookOrientation As RebarTerminationOrientation
)
public:
void SetTerminationOrientation(
	int end,
	RebarTerminationOrientation hookOrientation
)
member SetTerminationOrientation :
        end : int *
        hookOrientation : RebarTerminationOrientation -> unit
Parameters
end Int32
 0 for the start hook, 1 for the end hook.
hookOrientation RebarTerminationOrientation
 Only two values are permitted: Value = Right: The hook is on your right as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up." Value = Left: The hook is on your left as you stand at the end of the bar, with the bar behind you, taking the bar's normal as "up."
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  end must be 0 or 1. -or- A value passed for an enumeration argument is not a member of that enumeration
Remarks
 If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), setTerminationOrientation method does nothing.
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace